openfoam/OpenFOAM-dev/tutorials/incompressibleVoF/planingHullW3/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forces
{
    type            forces;
    libs            ("libforces.so");
    patches         (hull);
    log             on;
    writeControl    timeStep;
    writeInterval   1;
    CofR            (0 0 0);
}

rigidBodyState
{
    type           rigidBodyState;
    libs           ("librigidBodyState.so");
    angleUnits     [deg];
    angularVelocityUnits [deg/s];
}

#includeFunc surfaces

// ************************************************************************* //
